Reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
    <input type="hidden" name="post[sub_ids][]" value="">
    <% Sub.all.each do |sub| %>
      <input <%= 'checked' if @post.subs.include?(sub) %> type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"> <%= sub.title %><br>