Reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "In2fTXLiEOxVySqI56uh1Q"], ["updated_at", "2018-11-20 22:19:01.132331"], ["id", 1]]
---
  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!