Reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 5], ["sub_id", 1], ["created_at", "2018-11-21 00:57:15.921703"], ["updated_at", "2018-11-21 00:57:15.921703"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "first post"], ["url", ""], ["content", "First!!!"], ["sub_id", 1], ["author_id", 1], ["created_at", "2018-11-20 23:10:34.364637"], ["updated_at", "2018-11-20 23:10:34.364637"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id

    if @post.save

UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "dfgfd"], ["content", "dfgdfgd"], ["updated_at", "2018-11-21 01:10:25.533420"], ["id", 5]]
---
  def update
    @post = current_user.posts.find(params[:id])

    if @post.update(post_params)